README.org
#+Title: Advanced Data Structures - classes assignment
#+Author: Evan Misshula

* Introduction

You will write a classes for a prison, the prisoners and guards.

Initialize the prison has 40 cells. Write setter and getters for number of
beds and number of prisoners. A cell can only have one more prisoner than 
beds.  Make the number beds_ a private member.

Write a class for prisoners.  Prisoners should have 

- sentence months int
- time served int
- time to release
- number of children
- place of last residence
- approved visitors
- hours worked
- pay rate (float)
- commisary balance
- cell number
- health condition [1-5]

Write a class for guards:

- favorite weapon
- steroid use [0 or 1]
- preferred place to beat prisoners
- number of infractions
- contraband
- probationary status
- gang affiliation
